Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.5.75/samv70/edc/ATSAMV70J20.PIC
      <edc:AdjustPoint edc:_addr="0x40044034" edc:offset="0x60"/>
      <edc:SFRDef edc:_addr="0x40044094" edc:access="-----------------------------nnn" edc:cname="ACC_ACR" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="ACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ACC">
            <edc:SFRFieldDef edc:cname="ISEL" edc:desc="Current Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOPW" edc:desc="Low-power option." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HISP" edc:desc="High-speed option." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="HYST" edc:desc="Hysteresis Selection" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40044098" edc:offset="0x4C"/>
      <edc:SFRDef edc:_addr="0x400440E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="ACC_WPMR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="ACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ACC">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x414343"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400440E8" edc:access="-------------------------------r" edc:cname="ACC_WPSR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="ACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ACC">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400440EC" edc:offset="0x3F14"/>
      <edc:SFRDef edc:_addr="0x40048000" edc:access="----------------nnnn--nnnnnn-nnn" edc:cname="ICM_CFG" edc:impl="0xF3F7" edc:nzwidth="0x20" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="WBDIS" edc:desc="Write Back Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOMDIS" edc:desc="End of Monitoring Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLBDIS" edc:desc="Secondary List Branching Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BBC" edc:desc="Bus Burden Control" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="ASCD" edc:desc="Automatic Switch To Compare Digest" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUALBUFF" edc:desc="Dual Input Buffer" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UIHASH" edc:desc="User Initial Hash Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UALGO" edc:desc="User SHA Algorithm" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="SHA1" edc:desc="SHA1 algorithm processed" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SHA256" edc:desc="SHA256 algorithm processed" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SHA224" edc:desc="SHA224 algorithm processed" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40048004" edc:access="----------------wwwwwwwwwwww-www" edc:cname="ICM_CTRL" edc:impl="0xFFF7" edc:nzwidth="0x20" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="ICM Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DISABLE" edc:desc="ICM Disable Register" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="REHASH" edc:desc="Recompute Internal Hash" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RMDIS" edc:desc="Region Monitoring Disable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RMEN" edc:desc="Region Monitoring Enable" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40048008" edc:access="----------------rrrrrrrr-------r" edc:cname="ICM_SR" edc:impl="0xFF01" edc:nzwidth="0x20" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="ICM Controller Enable Register" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RAWRMDIS" edc:desc="Region Monitoring Disabled Raw Status" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RMDIS" edc:desc="Region Monitoring Disabled Status" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4004800C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40048010" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="ICM_IER" edc:impl="0x1FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="RHC" edc:desc="Region Hash Completed Interrupt Enable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RDM" edc:desc="Region Digest Mismatch Interrupt Enable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RBE" edc:desc="Region Bus Error Interrupt Enable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RWC" edc:desc="Region Wrap Condition detected Interrupt Enable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="REC" edc:desc="Region End bit Condition Detected Interrupt Enable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RSU" edc:desc="Region Status Updated Interrupt Disable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:desc="Undefined Register Access Detection Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40048014" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="ICM_IDR" edc:impl="0x1FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="RHC" edc:desc="Region Hash Completed Interrupt Disable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RDM" edc:desc="Region Digest Mismatch Interrupt Disable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RBE" edc:desc="Region Bus Error Interrupt Disable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RWC" edc:desc="Region Wrap Condition Detected Interrupt Disable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="REC" edc:desc="Region End bit Condition detected Interrupt Disable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RSU" edc:desc="Region Status Updated Interrupt Disable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:desc="Undefined Register Access Detection Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40048018" edc:access="-------rrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ICM_IMR" edc:impl="0x1FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="RHC" edc:desc="Region Hash Completed Interrupt Mask" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RDM" edc:desc="Region Digest Mismatch Interrupt Mask" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RBE" edc:desc="Region Bus Error Interrupt Mask" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RWC" edc:desc="Region Wrap Condition Detected Interrupt Mask" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="REC" edc:desc="Region End bit Condition Detected Interrupt Mask" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RSU" edc:desc="Region Status Updated Interrupt Mask" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:desc="Undefined Register Access Detection Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004801C" edc:access="-------rrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ICM_ISR" edc:impl="0x1FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="RHC" edc:desc="Region Hash Completed" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RDM" edc:desc="Region Digest Mismatch" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RBE" edc:desc="Region Bus Error" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RWC" edc:desc="Region Wrap Condition Detected" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="REC" edc:desc="Region End bit Condition Detected" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RSU" edc:desc="Region Status Updated Detected" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:desc="Undefined Register Access Detection Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40048020" edc:access="-----------------------------rrr" edc:cname="ICM_UASR" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="URAT" edc:desc="Undefined Register Access Trace" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="UNSPEC_STRUCT_MEMBER" edc:desc="Unspecified structure member set to one detected when the descriptor is loaded." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ICM_CFG_MODIFIED" edc:desc="ICM_CFG modified during active monitoring." edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ICM_DSCR_MODIFIED" edc:desc="ICM_DSCR modified during active monitoring." edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ICM_HASH_MODIFIED" edc:desc="ICM_HASH modified during active monitoring" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="READ_ACCESS" edc:desc="Write-only register read access" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40048024" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x40048030" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnn------" edc:cname="ICM_DSCR" edc:impl="0xFFFFFFC0" edc:nzwidth="0x20" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="DASA" edc:desc="Descriptor Area Start Address" edc:nzwidth="0x1A"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40048034" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnn-------" edc:cname="ICM_HASH" edc:impl="0xFFFFFF80" edc:nzwidth="0x20" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="HASA" edc:desc="Hash Area Start Address" edc:nzwidth="0x19"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
