Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.5.75/samv70/edc/ATSAMV70J20.PIC
      <edc:SFRDef edc:_addr="0x40078038" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:cname="XDMAC_GSWR" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SWREQ0" edc:desc="XDMAC Channel 0 Software Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ1" edc:desc="XDMAC Channel 1 Software Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ2" edc:desc="XDMAC Channel 2 Software Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ3" edc:desc="XDMAC Channel 3 Software Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ4" edc:desc="XDMAC Channel 4 Software Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ5" edc:desc="XDMAC Channel 5 Software Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ6" edc:desc="XDMAC Channel 6 Software Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ7" edc:desc="XDMAC Channel 7 Software Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ8" edc:desc="XDMAC Channel 8 Software Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ9" edc:desc="XDMAC Channel 9 Software Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ10" edc:desc="XDMAC Channel 10 Software Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ11" edc:desc="XDMAC Channel 11 Software Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ12" edc:desc="XDMAC Channel 12 Software Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ13" edc:desc="XDMAC Channel 13 Software Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ14" edc:desc="XDMAC Channel 14 Software Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ15" edc:desc="XDMAC Channel 15 Software Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ16" edc:desc="XDMAC Channel 16 Software Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ17" edc:desc="XDMAC Channel 17 Software Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ18" edc:desc="XDMAC Channel 18 Software Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ19" edc:desc="XDMAC Channel 19 Software Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ20" edc:desc="XDMAC Channel 20 Software Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ21" edc:desc="XDMAC Channel 21 Software Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ22" edc:desc="XDMAC Channel 22 Software Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ23" edc:desc="XDMAC Channel 23 Software Request Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4007803C" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="XDMAC_GSWS" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SWRS0" edc:desc="XDMAC Channel 0 Software Request Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRS1" edc:desc="XDMAC Channel 1 Software Request Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRS2" edc:desc="XDMAC Channel 2 Software Request Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRS3" edc:desc="XDMAC Channel 3 Software Request Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRS4" edc:desc="XDMAC Channel 4 Software Request Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRS5" edc:desc="XDMAC Channel 5 Software Request Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRS6" edc:desc="XDMAC Channel 6 Software Request Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRS7" edc:desc="XDMAC Channel 7 Software Request Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRS8" edc:desc="XDMAC Channel 8 Software Request Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRS9" edc:desc="XDMAC Channel 9 Software Request Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRS10" edc:desc="XDMAC Channel 10 Software Request Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRS11" edc:desc="XDMAC Channel 11 Software Request Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRS12" edc:desc="XDMAC Channel 12 Software Request Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRS13" edc:desc="XDMAC Channel 13 Software Request Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRS14" edc:desc="XDMAC Channel 14 Software Request Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRS15" edc:desc="XDMAC Channel 15 Software Request Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRS16" edc:desc="XDMAC Channel 16 Software Request Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRS17" edc:desc="XDMAC Channel 17 Software Request Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRS18" edc:desc="XDMAC Channel 18 Software Request Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRS19" edc:desc="XDMAC Channel 19 Software Request Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRS20" edc:desc="XDMAC Channel 20 Software Request Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRS21" edc:desc="XDMAC Channel 21 Software Request Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRS22" edc:desc="XDMAC Channel 22 Software Request Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRS23" edc:desc="XDMAC Channel 23 Software Request Status Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40078040" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:cname="XDMAC_GSWF" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SWF0" edc:desc="XDMAC Channel 0 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF1" edc:desc="XDMAC Channel 1 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF2" edc:desc="XDMAC Channel 2 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF3" edc:desc="XDMAC Channel 3 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF4" edc:desc="XDMAC Channel 4 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF5" edc:desc="XDMAC Channel 5 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF6" edc:desc="XDMAC Channel 6 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF7" edc:desc="XDMAC Channel 7 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF8" edc:desc="XDMAC Channel 8 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF9" edc:desc="XDMAC Channel 9 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF10" edc:desc="XDMAC Channel 10 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF11" edc:desc="XDMAC Channel 11 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF12" edc:desc="XDMAC Channel 12 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF13" edc:desc="XDMAC Channel 13 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF14" edc:desc="XDMAC Channel 14 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF15" edc:desc="XDMAC Channel 15 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF16" edc:desc="XDMAC Channel 16 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF17" edc:desc="XDMAC Channel 17 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF18" edc:desc="XDMAC Channel 18 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF19" edc:desc="XDMAC Channel 19 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF20" edc:desc="XDMAC Channel 20 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF21" edc:desc="XDMAC Channel 21 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF22" edc:desc="XDMAC Channel 22 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF23" edc:desc="XDMAC Channel 23 Software Flush Request Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
